Tekla.Structures.Dialog.UIControls.EnvironmentVariables
The EnvironmentVariables class contains a sorted list specializing in getting active
environment variables and advanced option settings. It also checks options.ini files
in the active model folder as well as options_user.ini files.

Tekla.Structures.Dialog.UIControls.EnvironmentVariables.GetEnvironmentVariable(System.String)
Gets an environment variable.
variableName: The name of the variable to get.
Returns: The environment variable.

Tekla.Structures.Dialog.UIControls.EnvironmentVariables.Add(System.String)
Adds a variable to the list.
key: The variable to be added.

Tekla.Structures.Dialog.UIControls.EnvironmentVariables.Get(System.String)
Gets a key.
key: The key to get.
Returns: The key.